Repository: patdunlavey/Williamstown-Beat
Catalog: sites/all/modules/tagadelic/translations/*.po
Languages: de

source: Tagadelic offers dynamic urls. <br/>Visit example.com/tagadelic/list/2,1,5 to get the vocabularies 2,1 and 5 listed as tag groups. <br/>Visit example.com/tagadelic/chunk/2,1,5 to get a tag cloud of the terms in the vocabularies 2,1 and 5.<br/> Note that we limit to five vocabularies.
de: Tagadelic stellt dynamische URLs zur Verfügung. <br/>Unter example.com/tagadelic/list/2,1,5 werden Beispielsweise die Vokabulare 2,1 und 5 als Tag-Gruppen aufgelistet. <br/>Unter example.com/tagadelic/chunk/2,1,5 wird Beispielweise eine Tag-Wolke aus den Begriffen der Vokabulare 2,1 und 5 angezeigt.<br/> Bitte beachten, dass es ein Limit von fünf Vokabularen gibt.

source: by weight, ascending
de: nach Reihenfolge, aufsteigend

source: by weight, descending
de: nach Reihenfolge, absteigend

source: by title, ascending
de: nach Titel, aufsteigend

source: by title, descending
de: nach Titel, absteigend

source: random
de: zufällig

source: Tagadelic sort order
de: Reihenfolge der Sortierung

source: Determines the sort order of the tags on the freetagging page.
de: Bestimmt die Sortierreihenfolge der Tags auf der Freetagging-Seite.

source: Amount of tags on the pages
de: Anzahl der Tags auf den Seiten

source: The amount of tags that will show up in a cloud on the pages. Amount of tags in blocks must be configured in the block settings of the various cloud blocks.
de: Die Anzahl von Tags, die auf den Seiten in einer Wolke erscheinen. Die Anzahl der Tags in den Blöcken muss in den Block-Einstellungen der verschiedenen Wolken-Blöcke konfiguriert werden.

source: Number of levels
de: Anzahl der Ebenen

source: The number of levels between the least popular tags and the most popular ones. Different levels will be assigned a different class to be themed in tagadelic.css
de: Anzahl der Ebenen zwischen der am beliebsteten und der unbeliebtesten Ebene. Den verschiedenen Ebenen wird jeweils eine unterschiedliche Klasse zugeordnet, die in der tagadelic.css-Datei angepasst werden kann.

source: view all posts tagged with "@tag"
de: Zeige alle Beiträge, die mit „@tag“ versehen sind

source: more tags
de: weitere Tags

source: Tags for @title
de: Tags für @title

source: Tags for the current post
de: Tags für den aktuellen Beitrag

source: Tags to show
de: Anzuzeigende Tags

source: The number of tags to show in this block.
de: Die Anzahl der Tags, die in diesem Block angezeigt werden sollen.

source: Tagadelic configuration
de: Tagadelic-Konfiguration

source: Configure the tag clouds. Set the order, the number of tags, and the depth of the clouds.
de: Konfiguration der Tag-Wolken. Die Reihenfolge, Anzahl der Tags und die Tiefe der Wolke einstellen.

source: Tagadelic makes weighted tag clouds from your taxonomy terms.
de: Tagadelic erstellt gewichtetet Tag-Wolken aus Taxonomie-Begriffen.

source: Taxonomy
de: Taxonomie
