Repository: patdunlavey/Williamstown-Beat
Catalog: sites/all/modules/taxonomy_csv/po/*.po
Languages: fr

source: Use this form to import a taxonomy or a list of terms into a vocabulary from a simple <a href="!link" title="Wikipedia definition">CSV</a> file.
fr: Ce module permet d'importer une taxinomie ou une liste de termes dans un vocabulaire à partir d'un simple fichier <a href="!link" title="Définition Wikipedia">CSV</a> .

source: <strong>Warning:</strong> If you want to update an existing vocabulary, make sure you have a backup before you proceed so you can roll back, if necessary.
fr: <strong>Attention :</strong> si vous voulez mettre à jour un vocabulaire existant, assurez-vous d'avoir sauvegardé ce dernier avant d'effectuer l'importation afin de pouvoir revenir en arrière si besoin.

source: This module allows you to !import-url into a vocabulary from a <a href="!wiki-url" title="Wikipedia definition">CSV</a> file.
fr: Ce module vous permet d'!import-url dans un vocabulaire à partir d'un fichier <a href="!wiki-url" title="Définition Wikipedia">CSV</a>.

source: import taxonomies or simple lists of terms
fr: importer des taxinomies ou de simples listes de termes

source: If you are unsure how to create a CSV file, you might want to use <a href="!ooo-link" title="OpenOffice.org">OpenOffice Calc</a> or another spreadsheet application to export your data into a CSV file.
fr: Si vous ne savez pas comment créer un fichier CSV, vous pouvez utiliser <a href="!ooo-link" title="OpenOffice.org">OpenOffice Calc</a> ou un autre tableur pour exporter vos données dans un fichier CSV.

source: You can choose how source will be imported and what existing terms will become and set advanced settings.
fr: Vous pouvez préciser comment la source sera importée, ce que deviendront les termes existants et paramêtrer les options avancées.

source: Source can be configured with the first field set. The term name will be imported from the first column. You can specify how additional columns should be imported:
fr: La source peut être configurée avec le premier groupe d'options. La première colonne indique toujours le nom du terme importé. Vous pouvez indiquer comment les colonnes suivantes doivent être importées.

source: Ignore
fr: Ignorer

source: This has the same effect has having a single column.
fr: Cette option a le même effet qu'importer un fichier d'une seule colonne.

source: Child term names or one term array structure
fr: Noms des termes enfants or one term array structure

source: The second column will be imported as the name of a child term of the term defined by the first column. The third column will be imported as a child of the second column, and so on. For example, you might have a line < <code>Animal,Mammal,Dog</code> >. Lines can have any order.
fr: Le nom dans la deuxième colonne sera importé comme un terme enfant du terme défini dans la première colonne. Le nom dans la troisième colonne sera importé comme un terme enfant du terme défini dans la deuxième colonne, etc. Par exemple, vous pouvez avoir une ligne < <code>Animal,Mammifère,Chien</code> >. Les lignes peuvent avoir n'importe quel ordre.

source: Related terms
fr: Termes connexes

source: Synonyms terms
fr: Termes synonymes

source: Term description
fr: Description du terme

source: The second column will be imported as the term description of the first column term.
fr: La seconde colonne sera importée comme description du terme défini dans la première colonne.

source: Term weights
fr: Poids des termes

source: The second column will be imported as weight of the term defined by first column.
fr: La seconde colonne sera importée comme poids du terme défini dans la première colonne.

source: Destination can be configured with the second field set. You can specify what will become existing terms. Three choices are possible:
fr: La destination peut être configurée avec le second groupe d'options. Vous pouvez définir ce que deviendront les termes existants. Trois choix sont possibles :

source: Update terms and merge existing
fr: Mettre les termes à jour et fusionner avec l'existant

source: Update current terms when name matches with imported ones and merge existing descriptions, parents, synonyms and related terms with new ones. Duplicates are removed. This choice is recommended if you want to keep a vocabulary and if you have descriptions, parents, synonyms and related terms you don't want to lose.
fr: Met à jour les termes existants lorsque le nom correspond avec celui des termes importés et fusionne les descriptions, parents, synonymes et termes connexes existants. Les doublons sont supprimés. Ce choix est conseillé si vous voulez conserver un vocabulaire et si vous avez des descriptions, des parents, des synonymes et des termes connexes que vous ne voulez pas perdre.

source: Update terms and replace existing
fr: Mettre les termes à jour et remplacer l'existant

source: Update current terms if name matches, but remove existing descriptions, parents, synonyms and related terms. Choose this option if you are want to create a clean new vocabulary without losing existing terms.
fr: Met à jour les termes existants si le nom correspond à celui des termes importés, mais remplace les descriptions, les parents, les termes synonymes et connexes existants. Choisissez cette option si vous voulez créer proprement un nouveau vocabulaire sans perdre les termes existants.

source: Be careful: if there is no description, parent, synonym or related term, i.e. the line contains only a term in the first column, this removes the existing.
fr: Attention : s'il n'y a pas de description, parent, synonyme ou terme connexe, c'est-à-dire si la ligne contient seulement un terme dans la première colonne, cela supprimera l'existant.

source: Ignore current terms and create new ones
fr: Ignorer les termes existants et en créer de nouveaux

source: Let current terms as they are and create totally new terms.
fr: Conserve les termes existants tels qu'ils sont et crée des termes totalement nouveaux.

source: Warning: This can create duplicate terms. It is recommended to use this option only if you are sure that imported taxonomy contains only new terms or if your vocabulary allows multiple parents.
fr: Attention : cela peut créer des doublons. Cette option est conseillée seulement si vous êtes sûr que la taxinomie importée contient seulement des termes nouveaux ou si votre vocabulaire autorise les parents multiples.

source: When you want to import child term names as well as descriptions, synonyms, related terms and term weights, you should begin with the file containing the hierarchical structure of parent and child. So first import child term names with the <em>Child term names</em> option. Second, upload the other files with the adequate option and one of the <em>Update terms...</em> option.
fr: Si vous voulez importer à la fois des termes enfants, des descriptions, des poids et des termes synonymes et connexes, vous devez commencer par le fichier contenant la structure hiérarchique des parents et des enfants. Ainsi, vous devez Ainsi, vous devez d'abord importer le fichier des termes enfants en choisissant l'option <em>Noms des termes enfants</em>. Ensuite, vous pouvez importer les autres fichiers en choisissant l'option adéquate et l'une ou l'autre option <em>Mettre à jour...</em>

source: Be careful: if 1) source choice is <strong>not</strong> <em>"Ignore"</em> additional columns, 2) file or a line in the file has only one column and 3) you choose <em>"Update and replace"</em>, the import process will be a remove process of matching items (first column terms are always kept or imported).
fr: Attention : si 1) le choix de la source <strong>n'est pas</strong> <em>"Ignorer"</em> les colonnes supplémentaires, 2) le fichier ou une ligne dans le fichier contient seulement une colonne et 3) vous choisissez <em>"Mettre à jour et remplacer"</em>, le processus d'importation deviendra un processus de suppression des éléments correspondants (les termes de la première colonne sont toujours conservés ou importés).

source: Delimiters (comma "<strong><code>,</code></strong>" or semicolon "<strong><code>;</code></strong>") between terms can be chosen in Advanced settings.
fr: Le séparateur (virgule "<strong><code>,</code></strong>" ou point-virgule "<strong><code>;</code></strong>") entre les termes peut être choisi dans les paramètres avancés.

source: Another Drupal module allows CSV import too, despite its name: <a href="http://drupal.org/project/taxonomy_xml" title="taxonomy XML">taxonomy XML</a>. Its approach is different: it uses one file complient to thesauri standard ISO 2788, i.e. a three columns csv file: <code>first term, type of link, second term</code>, or, for specialists, <code>subject, predicate, object</code>. So choose the module best matching your needs.
fr: Un autre module Drupal permet également l'mportation d'une taxinomie par le biais d'un fichier CSV, malgré son nom : <a href="http://drupal.org/project/taxonomy_xml" title="taxonomy XML">taxonomy XML</a>. Son approche est différente. Il utilise un fichier unique conforme à la norme ISO 2788 sur les thésaurus, en l'occurrence un fichier CSV à trois colonnes : <code>premier terme, type de lien, second terme</code>, ou, pour les specialistes, <code>sujet, prédicat, objet</code>. Vous pouvez donc choisir le module correspondant le mieux à vos besoins.

source: CSV file
fr: Fichier CSV

source: Due to server restrictions, the maximum upload file size is !size. Files that exceed this size will be disregarded without notice.
fr: En raison des restrictions du serveur, la taille maximale du fichier est !size. Les fichiers qui dépassent cette limite seront tronqués sans avertissement.

source: Term descriptions
fr: Descriptions des termes

source: Additional columns
fr: Colonnes supplémentaires

source: Vocabulary
fr: Vocabulaire

source: The vocabulary you want to import the file into. You might want to !add-new-vocab.
fr: Le vocabulaire dans lequel vous voulez importer les termes. Vous pouvez choisir d'!add-new-vocab.

source: add a new vocabulary
fr: ajouter un nouveau vocabulaire

source: [Auto create a new vocabulary]
fr: [Créer autmatiquement un nouveau vocabulaire]

source: Update terms and merge existing items
fr: Mettre les termes à jour et fusionner avec les éléments existants

source: Update terms and replace existing items
fr: Mettre les termes à jour et remplacer les éléments existants

source: Ignore existing terms and create new ones
fr: Ignorer les termes existants et en créer de nouveaux

source: Existing terms
fr: Termes existants

source: Whether existing terms with the same name should be updated or ignored. <p>For example, if existing related terms of term < <code>Drupal</code> > are < <code>Free</code> > and < <code>Open source</code> > and an imported line in the csv file is < <code>"Drupal","Knowledge management"</code> >, then: <dt><dd><em>"Update and merge"</em> choice make related terms of < <code>Drupal</code> > are now < <code>Free</code> >, < <code>Open source</code> > and < <code>Knowledge management</code> >;</dd> <dd><em>"Update and replace"</em> choice make related term of < <code>Drupal</code> > is now only < <code>Knowledge management</code> >;</dd> <dd><em>"Ignore and create"</em> choice make two < <code>Drupal</code> > terms, one with existing related and other items and another one with only the imported related term < <code>Knowledge management</code> >.</dd></dt>
fr: <p>Indique si les termes existants avec le même nom doivent être mis à jour ou ignorés.</p> <p>Par exemple, si les termes connexes du terme existant <code>"Drupal"</code> sont : <code>"Libre"</code> et <code>"Open source"</code> et si une ligne importée dans le fichier csv est <code>"Drupal",gestion des connaissances"</code>, alors : <dt><dd>l'option <em>"Mettre à jour et fusionner"</em> implique que les termes connexes de <code>"Drupal"</code> seront dorénavant <code>"Libre"</code>, <code>"Open source"</code> et <code>"gestion des connaissances"</code>;</dd> <dd>l'option <em>"Mettre à jour et remplacer"</em> implique que le terme connexe de <code>"Drupal"</code> est désormais seulement <code>"gestion des connaissances"</code>;</dd> <dd>l'option <em>"Ignorer et créer"</em> implique qu'il y aura désormais deux termes <code>"Drupal"</code>, l'un avec les termes connexes et les autres éléments existants, l'autre avec seulement le terme connexe <code>"gestion des connaissances"</code>.</dd></dt></p>

source: Advanced settings
fr: Paramètres avancés

source: Advanced import options
fr: Options d'importation avancées

source: Import subrelations
fr: Importer les sous-relations

source: Search existing terms in all vocabularies for relations
fr: Chercher les termes existants dans tous les vocabulaires pour les relations

source: Source format
fr: Format de la source

source: CSV file delimiter
fr: Séparateur de champs

source: Comma
fr: Virgule

source: Semicolon
fr: Point-virgule

source: Choose the delimiter used in the CSV file you want to import.
fr: Indiquez le séparateur de champs utilisé dans le fichier CSV que vous voulez importer.

source: Disable file conversion because the csv file is already UTF-8 encoded
fr: Désactive la conversion du fichier, car le fichier .csv est déjà encodé en UTF-8.

source: This checkbox disables the conversion of the CSV file to UTF-8, what can be a cause of problems with some rare server configurations. Be sure your file is UTF-8 encoded when using this option.
fr: Cette option désactive la conversion du fichier CSV en UTF-8, ce qui peut être une source de problèmes sur quelques rares configurations de serveur. Assurez-vous que votre fichier est encodé en UTF-8 avant d'utiliser cette option.

source: Result display
fr: Affichage des résultats

source: Type of view
fr: Type d'affichage

source: Group by message type (compact view)
fr: Grouper par type de message (vue compacte)

source: Group by line (list view)
fr: Grouper par ligne (vue en liste)

source: Choose the way you want to see import process result.
fr: Choisissez le mode d'affichage des résultats de l'importation

source: Log level
fr: Niveau de détail

source: Only warnings and errors
fr: Seulement les alertes et les erreurs

source: Full log
fr: Tout le journal

source: Choose level of details to display.
fr: Choisissez le niveau de détail à afficher

source: Import
fr: Importer

source: Please upload a file.
fr: Merci de choisir un fichier à télécharger.

source: Importing terms from CSV file "%file"
fr: Importation des termes du fichier CSV "%file"

source: Starting uploading of file...
fr: Début du téléchargement du fichier...

source: Imported @current out of @total lines.
fr: Ligne @current importée sur un total de @total.

source: An error occurred during the import.
fr: Une erreur est survenue lors de l'importation.

source: File "%file" uploaded.
fr: Fichier "%file" chargé.

source: An error occurred while processing
fr: Une erreur est survenue lors du traitement

source: with arguments:
fr: avec les arguments :

source: Line loaded.
fr: Ligne chargée.

source: Line cleaned:
fr: Ligne nettoyée :

source: Items checked:
fr: Éléments vérifiés :

source: Items imported:
fr: Éléments importés :

source: Auto created Vocabulary
fr: Vocabulaire créé automatiquement

source: Auto created vocabulary during import of the CSV file "!vocabulary_name".
fr: Vocabulaire créé automatiquement durant l'importation du fichier CSV "!vocabulary_name".

source: flat - no parent
fr: plat - aucun parent

source: single parent
fr: un seul parent

source: multiple parents
fr: parents multiples

source: Lines:
fr: Lignes :

source: Total created terms
fr: Nombre de termes créés

source: Total created and updated terms
fr: Nombre de termes créés et mis à jour

source: Total updated existing terms
fr: Nombre de termes existants mis à jour

source: Total processed import errors
fr: Nombre d'erreurs de traitement

source: ERROR
fr: ERREUR

source: Your file can't be converted to utf-8. Please install iconv, GNU recode or mbstring for PHP or convert your file to utf-8 and choose 'Disable utf-8 conversion' option. Import stopped.
fr: Votre fichier ne peut pas être converti en utf-8. Merci d'installer iconv, GNU recode ou mbstring for PHP ou de convertir votre fichier en utf-8 en choisissant l'option 'Désactiver la conversion utf-8. Importation arrêtée.

source: Despite your option, your file is not recognize as an UTF-8 encoded one. Convert it before submit it. Import stopped.
fr: Malgré votre choix, le fichier n'est pas reconnu comme étant encodé en UTF-8. Convertissez-le avant de le télécharger. Importation arrétée.

source: WARNING
fr: AVERTISSEMENT

source: Weight in second column is not an allowed number. This line won't be processed.
fr: Le poids dans la seconde colonne n'est pas un nombre autorisé. Cette ligne ne sera pas traitée.

source: No first column term to import. Empty first column is allowed only with children import. This line won't be processed.
fr: La première colonne ne contient aucun élément. Une première colonne peut être vide seulement pour l'importation d'enfants. Cette ligne ne sera pas traitée.

source: No line to import. This line won't be processed.
fr: Aucune ligne à importer. Cette ligne ne sera pas traitée.

source: No item to import. This line won't be processed.
fr: Aucun élément à importer. Cette ligne ne sera pas traitée.

source: Nothing to import. This line won't be processed.
fr: Rien à importer. Cette ligne ne sera pas traitée.

source: Notice
fr: Remarque

source: Too many items. Second and next columns will be ignored, as import choice is to ignore them.
fr: Trop d'éléments. La deuxième colonne et les suivantes seront ignorées, puisque le choix d'importation est de les ignorer.

source: Line contains empty items after first item to import. They will be ignored.
fr: La ligne contient des éléments vides après le premier élément. Ils seront ignorés.

source: Line contains duplicate items. Currently, duplicates will be ignored.
fr: La ligne contient des doublons. Actuellement, les doublons sont ignorés.

source: Line contains items matching first column term. A term can't be related to itself and a synonym may be different to it. Duplicates will be ignored.
fr: La ligne contient des éléments identiques au terme de la première colonne. Un terme ne peut pas être lié à lui-même et un synonyme doit être différent. Les doublons seront ignorés.

source: Line contains empty items. They will be ignored.
fr: La ligne contient des éléments vides. Ils seront ignorés.

source: Line contains duplicate items. Duplicates will be ignored.
fr: La ligne contient des doublons. Les doublons seront ignorés.

source: Too many items. Third and next columns will be ignored, as a term gets only one description and one weight.
fr: Trop d'éléments. La troisième colonne et les suivantes seront ignorées, puisqu'un terme peut avoir seulement une description et un poids.

source: Be careful. This line has only one term and import choice is to replace existing items. So they will be removed.
fr: Attention. Cette ligne a un seul terme et le choix d'importation est de remplacer les éléments existants. Ils seront donc supprimés.

source: Items have been successfully imported.
fr: Les éléments ont été correctement importés.

source: Saved new term.
fr: Nouveau terme enregistré.

source: Updated term.
fr: Terme mis à jour.

source: Debug
fr: Débogage

source: Unreferenced debug code. Please reinstall module from a fresh release or submit an issue.
fr: Code de débogage non référencé. Merci de réinstaller une version récente du module ou de signaler le problème.

source: Unreferenced debug code
fr: Code de débogage non référencé

source: CSV import
fr: Importer par CSV

source: Taxonomy CSV import
fr: Importation de taxinomie par CSV

source: Allow quick import of complete taxonomies or simple lists of terms and properties with a CSV file.
fr: Permet l'importation rapide de taxinomies complètes ou de simples listes de termes et de propriétés à partir d'un fichier CSV.

source: Taxonomy
fr: Taxinomie
